Repository: xcv58/MacTools
Catalog: Plugins/CloudflareR2/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# widget.title
source: R2 上传
ar: رفع R2
de: R2-Upload
en: R2 Upload
es: Subir a R2
fr: Envoi R2
ja: R2アップロード
ko: R2 업로드
pt: Enviar ao R2
ru: Загрузка в R2
tr: R2 Karşıya Yükleme
zh_hant: R2 上傳

# action.upload.keyword
source: 上传
ar: رفع
de: Hochladen
en: Upload
es: Subir
fr: Envoyer
ja: アップロード
ko: 업로드
pt: Enviar
ru: Загрузить
tr: Karşıya Yükle
zh_hant: 上傳

# action.upload.title
source: 选择文件并上传到 R2
ar: اختيار ملف ورفعه إلى R2
de: Datei auswählen und zu R2 hochladen
en: Choose a File and Upload to R2
es: Elegir un archivo y subirlo a R2
fr: Choisir un fichier et l’envoyer vers R2
ja: ファイルを選択して R2 にアップロード
ko: 파일을 선택하여 R2에 업로드
pt: Escolher um arquivo e enviar para o R2
ru: Выбрать файл и загрузить в R2
tr: Dosya Seç ve R2'ye Karşıya Yükle
zh_hant: 選擇檔案並上傳至 R2

# common.cancel
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# common.cancelUpload
source: 取消上传
ar: إلغاء الرفع
de: Upload abbrechen
en: Cancel Upload
es: Cancelar subida
fr: Annuler l’envoi
ja: アップロードをキャンセル
ko: 업로드 취소
pt: Cancelar upload
ru: Отменить загрузку
tr: Karşıya Yüklemeyi İptal Et
zh_hant: 取消上傳

# common.ok
source: 好的
ar: موافق
de: OK
en: OK
es: Aceptar
fr: OK
ja: OK
ko: 확인
pt: OK
ru: ОК
tr: Tamam
zh_hant: 好

# completion.copyLink
source: 复制链接
ar: نسخ الرابط
de: Link kopieren
en: Copy Link
es: Copiar enlace
fr: Copier le lien
ja: リンクをコピー
ko: 링크 복사
pt: Copiar link
ru: Скопировать ссылку
tr: Bağlantıyı Kopyala
zh_hant: 複製連結

# completion.message
source: %@ 已上传到 R2。
ar: تم رفع %@ إلى R2.
de: %@ wurde zu R2 hochgeladen.
en: %@ was uploaded to R2.
es: Se ha subido %@ a R2.
fr: %@ a été envoyé vers R2.
ja: %@ を R2 にアップロードしました。
ko: %@ 파일을 R2에 업로드했습니다.
pt: %@ foi enviado para o R2.
ru: %@ загружен в R2.
tr: %@, R2'ye karşıya yüklendi.
zh_hant: %@ 已上傳至 R2。

# completion.title
source: R2 上传完成
ar: اكتمل الرفع إلى R2
de: R2-Upload abgeschlossen
en: R2 Upload Complete
es: Carga en R2 completada
fr: Envoi vers R2 terminé
ja: R2 へのアップロード完了
ko: R2 업로드 완료
pt: Upload para o R2 concluído
ru: Загрузка в R2 завершена
tr: R2 Karşıya Yükleme Tamamlandı
zh_hant: R2 上傳完成

# error.configuration.incomplete
source: 请先完成 R2 配置。
ar: أكمل إعداد R2 أولاً.
de: Schließen Sie zuerst die R2-Konfiguration ab.
en: Complete the R2 configuration first.
es: Completa primero la configuración de R2.
fr: Configurez d’abord R2.
ja: 先に R2 の設定を完了してください。
ko: 먼저 R2 구성을 완료하십시오.
pt: Conclua primeiro a configuração do R2.
ru: Сначала завершите настройку R2.
tr: Önce R2 yapılandırmasını tamamlayın.
zh_hant: 請先完成 R2 設定。

# error.configuration.invalid
source: R2 配置无效。
ar: إعداد R2 غير صالح.
de: Die R2-Konfiguration ist ungültig.
en: The R2 configuration is invalid.
es: La configuración de R2 no es válida.
fr: La configuration R2 n’est pas valide.
ja: R2 の設定が無効です。
ko: R2 구성이 유효하지 않습니다.
pt: A configuração do R2 é inválida.
ru: Недопустимая конфигурация R2.
tr: R2 yapılandırması geçersiz.
zh_hant: R2 設定無效。

# error.configuration.openSettings
source: 请先在设置中完成 R2 配置。
ar: أكمل إعداد R2 في الإعدادات أولاً.
de: Schließen Sie zuerst die R2-Konfiguration in den Einstellungen ab.
en: Complete the R2 configuration in Settings first.
es: Completa primero la configuración de R2 en Ajustes.
fr: Configurez d’abord R2 dans Réglages.
ja: 先に設定で R2 の構成を完了してください。
ko: 먼저 설정에서 R2 구성을 완료하십시오.
pt: Conclua primeiro a configuração do R2 nos Ajustes.
ru: Сначала завершите настройку R2 в параметрах.
tr: Önce Ayarlar'da R2 yapılandırmasını tamamlayın.
zh_hant: 請先在「設定」中完成 R2 設定。

# error.file.invalid
source: 请选择有效的文件。
ar: اختر ملفاً صالحاً.
de: Wählen Sie eine gültige Datei aus.
en: Choose a valid file.
es: Elige un archivo válido.
fr: Choisissez un fichier valide.
ja: 有効なファイルを選択してください。
ko: 유효한 파일을 선택하십시오.
pt: Escolha um arquivo válido.
ru: Выберите допустимый файл.
tr: Geçerli bir dosya seçin.
zh_hant: 請選擇有效的檔案。

# error.keychain.access
source: 无法访问钥匙串：%@（%d）
ar: تعذر الوصول إلى سلسلة المفاتيح: %@ (%d)
de: Zugriff auf den Schlüsselbund fehlgeschlagen: %@ (%d)
en: Couldn’t access Keychain: %@ (%d)
es: No se ha podido acceder al llavero: %@ (%d)
fr: Impossible d’accéder au trousseau : %@ (%d)
ja: キーチェーンにアクセスできませんでした：%@（%d）
ko: 키체인에 접근할 수 없습니다: %@(%d)
pt: Não foi possível acessar as Chaves: %@ (%d)
ru: Не удалось получить доступ к Связке ключей: %@ (%d)
tr: Keychain'e erişilemedi: %@ (%d)
zh_hant: 無法存取鑰匙圈：%@（%d）

# error.objectName.invalid
source: 文件名无效。
ar: اسم الملف غير صالح.
de: Der Dateiname ist ungültig.
en: The file name is invalid.
es: El nombre de archivo no es válido.
fr: Le nom du fichier n’est pas valide.
ja: ファイル名が無効です。
ko: 파일 이름이 유효하지 않습니다.
pt: O nome do arquivo é inválido.
ru: Недопустимое имя файла.
tr: Dosya adı geçersiz.
zh_hant: 檔案名稱無效。

# error.objectPrefix.invalid
source: 对象路径前缀不能包含“.”或“..”。
ar: لا يمكن أن تحتوي بادئة مسار الكائن على «.» أو «..».
de: Das Objektpfadpräfix darf weder „.“ noch „..“ enthalten.
en: The object path prefix cannot contain "." or "..".
es: El prefijo de la ruta del objeto no puede contener «.» ni «..».
fr: Le préfixe du chemin d’objet ne peut pas contenir « . » ni « .. ».
ja: オブジェクトパスのプレフィックスに「.」または「..」は使用できません。
ko: 객체 경로 접두사에는 '.' 또는 '..'을 포함할 수 없습니다.
pt: O prefixo do caminho do objeto não pode conter "." nem "..".
ru: Префикс пути объекта не может содержать «.» или «..».
tr: Nesne yolu öneki "." veya ".." içeremez.
zh_hant: 物件路徑前綴不可包含「.」或「..」。

# error.response.invalid
source: R2 返回了无效响应。
ar: أعاد R2 استجابة غير صالحة.
de: R2 hat eine ungültige Antwort zurückgegeben.
en: R2 returned an invalid response.
es: R2 ha devuelto una respuesta no válida.
fr: R2 a renvoyé une réponse non valide.
ja: R2 から無効な応答が返されました。
ko: R2에서 유효하지 않은 응답을 반환했습니다.
pt: O R2 retornou uma resposta inválida.
ru: R2 вернул недопустимый ответ.
tr: R2 geçersiz bir yanıt döndürdü.
zh_hant: R2 傳回了無效的回應。

# error.secret.missing
source: 请先保存 Secret Access Key。
ar: احفظ Secret Access Key أولاً.
de: Speichern Sie zuerst den Secret Access Key.
en: Save the Secret Access Key first.
es: Guarda primero la Secret Access Key.
fr: Enregistrez d’abord la Secret Access Key.
ja: 先に Secret Access Key を保存してください。
ko: 먼저 Secret Access Key를 저장하십시오.
pt: Salve primeiro a Secret Access Key.
ru: Сначала сохраните Secret Access Key.
tr: Önce Secret Access Key'i kaydedin.
zh_hant: 請先儲存 Secret Access Key。

# error.upload.http
source: 上传失败（HTTP %d）。
ar: فشل الرفع (HTTP %d).
de: Upload fehlgeschlagen (HTTP %d).
en: Upload failed (HTTP %d).
es: La subida ha fallado (HTTP %d).
fr: Échec de l’envoi (HTTP %d).
ja: アップロードに失敗しました（HTTP %d）。
ko: 업로드에 실패했습니다(HTTP %d).
pt: Falha no upload (HTTP %d).
ru: Сбой загрузки (HTTP %d).
tr: Karşıya yükleme başarısız (HTTP %d).
zh_hant: 上傳失敗（HTTP %d）。

# filePicker.title
source: 选择要上传到 R2 的文件
ar: اختر ملفاً لرفعه إلى R2
de: Datei zum Hochladen zu R2 auswählen
en: Choose a File to Upload to R2
es: Elige un archivo para subirlo a R2
fr: Choisissez un fichier à envoyer vers R2
ja: R2 にアップロードするファイルを選択
ko: R2에 업로드할 파일 선택
pt: Escolha um arquivo para enviar ao R2
ru: Выберите файл для загрузки в R2
tr: R2'ye Karşıya Yüklenecek Dosyayı Seçin
zh_hant: 選擇要上傳至 R2 的檔案

# metadata.description
source: 上传文件到 Cloudflare R2
ar: رفع الملفات إلى Cloudflare R2
de: Dateien zu Cloudflare R2 hochladen
en: Upload files to Cloudflare R2
es: Sube archivos a Cloudflare R2
fr: Envoyez des fichiers vers Cloudflare R2
ja: Cloudflare R2 にファイルをアップロード
ko: Cloudflare R2에 파일 업로드
pt: Envie arquivos para o Cloudflare R2
ru: Загружайте файлы в Cloudflare R2
tr: Dosyaları Cloudflare R2'ye karşıya yükleyin
zh_hant: 將檔案上傳至 Cloudflare R2

# metadata.title
source: Cloudflare R2 上传
ar: الرفع إلى Cloudflare R2
de: Cloudflare R2-Upload
en: Cloudflare R2 Upload
es: Carga en Cloudflare R2
fr: Envoi vers Cloudflare R2
ja: Cloudflare R2 アップロード
ko: Cloudflare R2 업로드
pt: Upload para o Cloudflare R2
ru: Загрузка в Cloudflare R2
tr: Cloudflare R2 Karşıya Yükleme
zh_hant: Cloudflare R2 上傳

# panel.button.choose
source: 选择
ar: اختيار
de: Auswählen
en: Choose
es: Elegir
fr: Choisir
ja: 選択
ko: 선택
pt: Escolher
ru: Выбрать
tr: Seç
zh_hant: 選擇

# settings.action.save
source: 保存配置
ar: حفظ الإعداد
de: Konfiguration speichern
en: Save Configuration
es: Guardar configuración
fr: Enregistrer la configuration
ja: 設定を保存
ko: 구성 저장
pt: Salvar configuração
ru: Сохранить конфигурацию
tr: Yapılandırmayı Kaydet
zh_hant: 儲存設定

# settings.credentials.bucket.placeholder
source: Bucket 名称
ar: اسم الـ Bucket
de: Bucket-Name
en: Bucket name
es: Nombre del Bucket
fr: Nom du Bucket
ja: Bucket 名
ko: Bucket 이름
pt: Nome do Bucket
ru: Имя Bucket
tr: Bucket adı
zh_hant: Bucket 名稱

# settings.credentials.section
source: R2 凭据
ar: بيانات اعتماد R2
de: R2-Zugangsdaten
en: R2 Credentials
es: Credenciales de R2
fr: Identifiants R2
ja: R2 認証情報
ko: R2 자격 증명
pt: Credenciais do R2
ru: Учетные данные R2
tr: R2 Kimlik Bilgileri
zh_hant: R2 憑證

# settings.guide.bucket.detail
source: Cloudflare 控制台 → R2 对象存储；Bucket 名称来自存储桶列表，Account ID 位于 R2 概览的账户信息中。
ar: لوحة Cloudflare ← تخزين كائنات R2. يظهر اسم الـ Bucket في قائمة الحاويات، ويظهر Account ID في معلومات الحساب ضمن نظرة R2 العامة.
de: Cloudflare-Dashboard → R2 Object Storage. Den Bucket-Namen finden Sie in der Bucket-Liste und die Account ID in den Kontoinformationen der R2-Übersicht.
en: Cloudflare Dashboard → R2 Object Storage. Find the Bucket name in the bucket list and the Account ID in the account information on the R2 Overview page.
es: Panel de Cloudflare → Almacenamiento de objetos R2. El nombre del Bucket aparece en la lista de buckets y el Account ID, en la información de la cuenta de la vista general de R2.
fr: Tableau de bord Cloudflare → Stockage d’objets R2. Le nom du Bucket figure dans la liste des buckets et l’Account ID dans les informations du compte de la vue d’ensemble R2.
ja: Cloudflare ダッシュボード → R2 Object Storage。Bucket 名はバケット一覧、Account ID は R2 Overview のアカウント情報に表示されます。
ko: Cloudflare 대시보드 → R2 Object Storage. Bucket 이름은 버킷 목록에서, Account ID는 R2 Overview의 계정 정보에서 확인할 수 있습니다.
pt: Painel da Cloudflare → Armazenamento de objetos R2. O nome do Bucket fica na lista de buckets e o Account ID, nas informações da conta na visão geral do R2.
ru: Панель Cloudflare → Хранилище объектов R2. Имя Bucket указано в списке бакетов, а Account ID — в сведениях об учетной записи на странице обзора R2.
tr: Cloudflare Dashboard → R2 Object Storage. Bucket adını bucket listesinde, Account ID'yi R2 Overview sayfasındaki hesap bilgilerinde bulabilirsiniz.
zh_hant: Cloudflare 控制台 → R2 物件儲存空間；Bucket 名稱位於儲存貯體列表，Account ID 位於 R2 概覽的帳戶資訊中。

# settings.guide.bucket.title
source: 创建或选择 Bucket
ar: إنشاء Bucket أو اختياره
de: Bucket erstellen oder auswählen
en: Create or Choose a Bucket
es: Crear o elegir un Bucket
fr: Créer ou choisir un Bucket
ja: Bucket を作成または選択
ko: Bucket 생성 또는 선택
pt: Criar ou escolher um Bucket
ru: Создать или выбрать Bucket
tr: Bucket Oluşturun veya Seçin
zh_hant: 建立或選擇 Bucket

# settings.guide.credentials.detail
source: R2 概览 → 账户详情，在 API Token 旁点“管理”。创建账户或用户 API Token，并选择“对象读和写”。创建后复制 Access Key ID 和 Secret Access Key；Secret 仅显示一次。
ar: نظرة R2 العامة ← Account Details، ثم اختر Manage بجوار API Tokens. أنشئ Account API token أو User API token واختر صلاحية Object Read & Write. بعد الإنشاء، انسخ Access Key ID وSecret Access Key؛ فلن يظهر المفتاح السري إلا مرة واحدة.
de: R2-Übersicht → Account Details. Wählen Sie neben API Tokens die Option Manage. Erstellen Sie ein Account API token oder User API token und wählen Sie die Berechtigung Object Read & Write. Kopieren Sie anschließend Access Key ID und Secret Access Key; der geheime Schlüssel wird nur einmal angezeigt.
en: R2 Overview → Account Details. Select Manage next to API Tokens. Create an Account API token or User API token and choose the Object Read & Write permission. After creating the token, copy the Access Key ID and Secret Access Key; the secret is shown only once.
es: Vista general de R2 → Account Details. Selecciona Manage junto a API Tokens. Crea un Account API token o User API token y elige el permiso Object Read & Write. Después de crear el token, copia la Access Key ID y la Secret Access Key; el secreto solo se muestra una vez.
fr: Vue d’ensemble R2 → Account Details. Sélectionnez Manage en regard de API Tokens. Créez un Account API token ou un User API token, puis choisissez l’autorisation Object Read & Write. Après la création du jeton, copiez l’Access Key ID et la Secret Access Key ; le secret ne s’affiche qu’une seule fois.
ja: R2 Overview → Account Details で、API Tokens の横にある Manage を選択します。Account API token または User API token を作成し、Object Read & Write 権限を選択します。作成後、Access Key ID と Secret Access Key をコピーしてください。シークレットは一度しか表示されません。
ko: R2 Overview → Account Details에서 API Tokens 옆의 Manage를 선택합니다. Account API token 또는 User API token을 생성하고 Object Read & Write 권한을 선택합니다. 생성 후 Access Key ID와 Secret Access Key를 복사하십시오. 비밀 키는 한 번만 표시됩니다.
pt: Visão geral do R2 → Account Details. Selecione Manage ao lado de API Tokens. Crie um Account API token ou User API token e escolha a permissão Object Read & Write. Depois de criar o token, copie a Access Key ID e a Secret Access Key; o segredo é exibido apenas uma vez.
ru: Обзор R2 → Account Details. Нажмите Manage рядом с API Tokens. Создайте Account API token или User API token и выберите разрешение Object Read & Write. После создания токена скопируйте Access Key ID и Secret Access Key; секретный ключ отображается только один раз.
tr: R2 Overview → Account Details. API Tokens'un yanındaki Manage'yi seçin. Account API token veya User API token oluşturup Object Read & Write iznini seçin. Token'ı oluşturduktan sonra Access Key ID ve Secret Access Key'i kopyalayın; secret yalnızca bir kez gösterilir.
zh_hant: R2 概覽 → 帳戶詳細資料，在 API Token 旁按一下「管理」。建立帳戶或使用者 API Token，並選擇「物件讀取和寫入」。建立後複製 Access Key ID 和 Secret Access Key；Secret 僅顯示一次。

# settings.guide.credentials.title
source: 创建 S3 API 凭据
ar: إنشاء بيانات اعتماد S3 API
de: S3-API-Zugangsdaten erstellen
en: Create S3 API Credentials
es: Crear credenciales de la API de S3
fr: Créer des identifiants d’API S3
ja: S3 API 認証情報を作成
ko: S3 API 자격 증명 생성
pt: Criar credenciais da API S3
ru: Создать учетные данные S3 API
tr: S3 API Kimlik Bilgileri Oluşturun
zh_hant: 建立 S3 API 憑證

# settings.guide.credentialsDocs
source: 查看凭据文档
ar: عرض وثائق بيانات الاعتماد
de: Dokumentation zu Zugangsdaten
en: View Credential Documentation
es: Ver documentación de credenciales
fr: Consulter la documentation des identifiants
ja: 認証情報のドキュメントを表示
ko: 자격 증명 문서 보기
pt: Ver documentação de credenciais
ru: Документация по учетным данным
tr: Kimlik Bilgisi Belgelerini Görüntüle
zh_hant: 查看憑證文件

# settings.guide.openDashboard
source: 打开 R2 控制台
ar: فتح لوحة R2
de: R2-Dashboard öffnen
en: Open R2 Dashboard
es: Abrir panel de R2
fr: Ouvrir le tableau de bord R2
ja: R2 ダッシュボードを開く
ko: R2 대시보드 열기
pt: Abrir painel do R2
ru: Открыть панель R2
tr: R2 Dashboard'u Aç
zh_hant: 開啟 R2 控制台

# settings.guide.publicAccessDocs
source: 查看公开访问文档
ar: عرض وثائق الوصول العام
de: Dokumentation zum öffentlichen Zugriff
en: View Public Access Documentation
es: Ver documentación de acceso público
fr: Consulter la documentation sur l’accès public
ja: 公開アクセスのドキュメントを表示
ko: 공개 접근 문서 보기
pt: Ver documentação de acesso público
ru: Документация по публичному доступу
tr: Genel Erişim Belgelerini Görüntüle
zh_hant: 查看公開存取文件

# settings.guide.publicURL.detail
source: Bucket → 设置 → 自定义域，或启用 r2.dev 开发地址；填写包含 https:// 的根地址。
ar: Bucket ← Settings ← Custom Domains، أو فعّل عنوان التطوير r2.dev. أدخل عنوان الجذر كاملاً متضمناً https://.
de: Bucket → Settings → Custom Domains. Alternativ können Sie die r2.dev-Entwicklungs-URL aktivieren. Geben Sie die Stamm-URL einschließlich https:// ein.
en: Bucket → Settings → Custom Domains, or enable the r2.dev development URL. Enter the root URL, including https://.
es: Bucket → Settings → Custom Domains, o activa la URL de desarrollo de r2.dev. Introduce la URL raíz, incluido https://.
fr: Bucket → Settings → Custom Domains, ou activez l’URL de développement r2.dev. Saisissez l’URL racine, avec https://.
ja: Bucket → Settings → Custom Domains、または r2.dev 開発 URL を有効にします。https:// を含むルート URL を入力してください。
ko: Bucket → Settings → Custom Domains에서 설정하거나 r2.dev 개발 URL을 활성화합니다. https://를 포함한 루트 URL을 입력하십시오.
pt: Bucket → Settings → Custom Domains, ou ative a URL de desenvolvimento r2.dev. Insira a URL raiz, incluindo https://.
ru: Bucket → Settings → Custom Domains либо включите адрес для разработки r2.dev. Укажите корневой URL, включая https://.
tr: Bucket → Settings → Custom Domains veya r2.dev geliştirme adresini etkinleştirin. https:// dahil kök adresi girin.
zh_hant: Bucket → 設定 → 自訂網域，或啟用 r2.dev 開發網址；填寫包含 https:// 的根網址。

# settings.guide.publicURL.title
source: 配置公开访问地址（可选）
ar: إعداد عنوان الوصول العام (اختياري)
de: Öffentliche Zugriffs-URL konfigurieren (optional)
en: Configure a Public Access URL (Optional)
es: Configurar una URL de acceso público (opcional)
fr: Configurer une URL d’accès public (facultatif)
ja: 公開アクセス URL を設定（任意）
ko: 공개 접근 URL 구성(선택 사항)
pt: Configurar uma URL de acesso público (opcional)
ru: Настроить URL публичного доступа (необязательно)
tr: Genel Erişim Adresi Yapılandır (İsteğe Bağlı)
zh_hant: 設定公開存取網址（選用）

# settings.guide.section
source: 配置指引
ar: دليل الإعداد
de: Einrichtungsanleitung
en: Setup Guide
es: Guía de configuración
fr: Guide de configuration
ja: 設定ガイド
ko: 구성 안내
pt: Guia de configuração
ru: Руководство по настройке
tr: Kurulum Kılavuzu
zh_hant: 設定指南

# settings.options.objectPrefix
source: 对象前缀
ar: بادئة الكائن
de: Objektpräfix
en: Object Prefix
es: Prefijo de objeto
fr: Préfixe d’objet
ja: オブジェクトプレフィックス
ko: 객체 접두사
pt: Prefixo do objeto
ru: Префикс объекта
tr: Nesne Öneki
zh_hant: 物件前綴

# settings.options.objectPrefix.placeholder
source: 例如 uploads/2026（可选）
ar: مثال: uploads/2026 (اختياري)
de: Beispiel: uploads/2026 (optional)
en: For example, uploads/2026 (optional)
es: Por ejemplo, uploads/2026 (opcional)
fr: Par exemple, uploads/2026 (facultatif)
ja: 例：uploads/2026（任意）
ko: 예: uploads/2026(선택 사항)
pt: Por exemplo, uploads/2026 (opcional)
ru: Например, uploads/2026 (необязательно)
tr: Örneğin uploads/2026 (isteğe bağlı)
zh_hant: 例如 uploads/2026（選用）

# settings.options.publicURL
source: 公开访问地址
ar: عنوان الوصول العام
de: Öffentliche Zugriffs-URL
en: Public Access URL
es: URL de acceso público
fr: URL d’accès public
ja: 公開アクセス URL
ko: 공개 접근 URL
pt: URL de acesso público
ru: URL публичного доступа
tr: Genel Erişim Adresi
zh_hant: 公開存取網址

# settings.options.publicURL.placeholder
source: https://cdn.example.com（可选）
ar: https://cdn.example.com (اختياري)
de: https://cdn.example.com (optional)
en: https://cdn.example.com (optional)
es: https://cdn.example.com (opcional)
fr: https://cdn.example.com (facultatif)
ja: https://cdn.example.com（任意）
ko: https://cdn.example.com(선택 사항)
pt: https://cdn.example.com (opcional)
ru: https://cdn.example.com (необязательно)
tr: https://cdn.example.com (isteğe bağlı)
zh_hant: https://cdn.example.com（選用）

# settings.options.section
source: 上传选项
ar: خيارات الرفع
de: Upload-Optionen
en: Upload Options
es: Opciones de subida
fr: Options d’envoi
ja: アップロードオプション
ko: 업로드 옵션
pt: Opções de upload
ru: Параметры загрузки
tr: Karşıya Yükleme Seçenekleri
zh_hant: 上傳選項

# settings.secret.keychainNotice
source: Secret Access Key 仅保存在 macOS 钥匙串中。
ar: يُحفظ Secret Access Key في سلسلة مفاتيح macOS فقط.
de: Der Secret Access Key wird nur im macOS-Schlüsselbund gespeichert.
en: The Secret Access Key is stored only in macOS Keychain.
es: La Secret Access Key solo se guarda en el llavero de macOS.
fr: La Secret Access Key est uniquement enregistrée dans le trousseau macOS.
ja: Secret Access Key は macOS キーチェーンにのみ保存されます。
ko: Secret Access Key는 macOS 키체인에만 저장됩니다.
pt: A Secret Access Key é armazenada apenas nas Chaves do macOS.
ru: Secret Access Key хранится только в Связке ключей macOS.
tr: Secret Access Key yalnızca macOS Keychain'de saklanır.
zh_hant: Secret Access Key 僅儲存在 macOS 鑰匙圈中。

# settings.secret.notSaved
source: 尚未保存
ar: غير محفوظ
de: Nicht gespeichert
en: Not saved
es: No guardada
fr: Non enregistrée
ja: 未保存
ko: 저장되지 않음
pt: Não salva
ru: Не сохранен
tr: Kaydedilmedi
zh_hant: 尚未儲存

# settings.secret.placeholder
source: 输入 Secret Access Key
ar: أدخل Secret Access Key
de: Secret Access Key eingeben
en: Enter the Secret Access Key
es: Introduce la Secret Access Key
fr: Saisissez la Secret Access Key
ja: Secret Access Key を入力
ko: Secret Access Key 입력
pt: Insira a Secret Access Key
ru: Введите Secret Access Key
tr: Secret Access Key'yi girin
zh_hant: 輸入 Secret Access Key

# settings.secret.saved
source: 已保存；留空不会覆盖
ar: محفوظ؛ اتركه فارغاً للاحتفاظ به
de: Gespeichert; leer lassen, um ihn beizubehalten
en: Saved; leave blank to keep it unchanged
es: Guardada; déjala en blanco para no cambiarla
fr: Enregistrée ; laissez ce champ vide pour la conserver
ja: 保存済み。変更しない場合は空欄のままにしてください
ko: 저장됨. 변경하지 않으려면 비워 두십시오
pt: Salva; deixe em branco para mantê-la
ru: Сохранен; оставьте поле пустым, чтобы не изменять
tr: Kaydedildi; değiştirmemek için boş bırakın
zh_hant: 已儲存；留空不會覆寫

# shortcut.group.description
source: 设置打开 R2 文件上传器的全局快捷键。
ar: عيّن اختصار لوحة مفاتيح عام لفتح أداة رفع ملفات R2.
de: Globale Tastenkombination zum Öffnen des R2-Datei-Uploaders festlegen.
en: Set a global keyboard shortcut to open the R2 file uploader.
es: Configura un atajo de teclado global para abrir el cargador de archivos de R2.
fr: Définissez un raccourci clavier global pour ouvrir l’outil d’envoi de fichiers R2.
ja: R2 ファイルアップローダを開くグローバルキーボードショートカットを設定します。
ko: R2 파일 업로더를 여는 전역 키보드 단축키를 설정합니다.
pt: Defina um atalho de teclado global para abrir o uploader de arquivos do R2.
ru: Назначьте глобальное сочетание клавиш для открытия загрузчика файлов R2.
tr: R2 dosya yükleyicisini açmak için genel bir klavye kısayolu ayarlayın.
zh_hant: 設定用來開啟 R2 檔案上傳器的全域鍵盤快速鍵。

# shortcut.group.title
source: 上传
ar: رفع
de: Upload
en: Upload
es: Subida
fr: Envoi
ja: アップロード
ko: 업로드
pt: Upload
ru: Загрузка
tr: Karşıya Yükleme
zh_hant: 上傳

# shortcut.upload.description
source: 打开文件选择器并上传到 Cloudflare R2。
ar: فتح منتقي الملفات ورفع ملف إلى Cloudflare R2.
de: Dateiauswahl öffnen und eine Datei zu Cloudflare R2 hochladen.
en: Open the file picker and upload a file to Cloudflare R2.
es: Abre el selector de archivos y sube un archivo a Cloudflare R2.
fr: Ouvrez le sélecteur de fichiers et envoyez un fichier vers Cloudflare R2.
ja: ファイル選択パネルを開き、Cloudflare R2 にファイルをアップロードします。
ko: 파일 선택기를 열고 Cloudflare R2에 파일을 업로드합니다.
pt: Abra o seletor de arquivos e envie um arquivo para o Cloudflare R2.
ru: Откройте окно выбора и загрузите файл в Cloudflare R2.
tr: Dosya seçiciyi açın ve bir dosyayı Cloudflare R2'ye karşıya yükleyin.
zh_hant: 開啟檔案選擇器並上傳至 Cloudflare R2。

# shortcut.upload.title
source: 选择文件并上传
ar: اختيار ملف ورفعه
de: Datei auswählen und hochladen
en: Choose a File and Upload
es: Elegir un archivo y subirlo
fr: Choisir un fichier et l’envoyer
ja: ファイルを選択してアップロード
ko: 파일 선택 및 업로드
pt: Escolher um arquivo e enviar
ru: Выбрать и загрузить файл
tr: Dosya Seç ve Karşıya Yükle
zh_hant: 選擇檔案並上傳

# status.failed
source: 上传失败
ar: فشل الرفع
de: Upload fehlgeschlagen
en: Upload Failed
es: Error de subida
fr: Échec de l’envoi
ja: アップロード失敗
ko: 업로드 실패
pt: Falha no upload
ru: Сбой загрузки
tr: Karşıya Yükleme Başarısız
zh_hant: 上傳失敗

# status.idle
source: 上传文件到 Cloudflare R2
ar: رفع الملفات إلى Cloudflare R2
de: Dateien zu Cloudflare R2 hochladen
en: Upload files to Cloudflare R2
es: Sube archivos a Cloudflare R2
fr: Envoyez des fichiers vers Cloudflare R2
ja: Cloudflare R2 にファイルをアップロード
ko: Cloudflare R2에 파일 업로드
pt: Envie arquivos para o Cloudflare R2
ru: Загружайте файлы в Cloudflare R2
tr: Dosyaları Cloudflare R2'ye karşıya yükleyin
zh_hant: 將檔案上傳至 Cloudflare R2
